[{
    "title": "Just Cause 3",
    "platform": "PS4",
    "release": "December 1st 2015" ,
    "condition": "Condition: Very Good",
    "image":  "http://raciopporyan.github.io/Final Assignment/images/ps4_justcause3_eu.jpg",
    "comments": [
        {
        "username": "VidjaGames",
        "rating": "9/10",
        "review": "     Just Cause 3 creates a realistic nation with an oppressive government and then let's you right that wrong. There are however drawbacks to a world that's perhaps too realistic/ immersive. There are big open spaces that can be annoying to traverse. The cities are very similar looking which is also accurate to how must of earth is but it can also make them boring."
    }, {
        "username": "Niceguy3210",
        "rating": "7/10",
        "review": "I like this game a lot, but I do have issues with it. Issues like the gear currency. You need to do side missions to earn more gears to upgrade your abilities. But the problem with that, is that it is mind numbingly boring. Seriously, I beat the campaign and liberated every location in the game, and only upgraded 2 abilities."
    }, {
        "username": "Chamberspank",
        "rating": "7/10",
        "review": "The games gives you a lot of freedom. It's nothing were you need your brain. It's just action without a meaningful story. It reminds me of expendables. It's pure action and nothing else. Nothing to think about too much. Beside the massive amount of really ugly video fade-outs and the unnecessary loading times the controls could have been a little bit more intuitive."  
    }]
    

},  {
    "title": "Infamous Second Son",
    "platform": "PS4",
    "release": "March 21st 2014",
    "condition": "Condition: Brand New!",
    "image":  "http://raciopporyan.github.io/Final Assignment/images/ps4_infamoussecondson.jpg" ,
    "comments": [
        {
        "username": "Cranerfish",
        "rating": "10/10",
        "review": "InFamous Second Son may be the greatest superhero game of all time. It offers beautiful graphics, an interesting story, with some very emotional writing, and amazing gameplay. The different powers are all brilliant, and you can never walk into a mission the same way. The characters are well written, and they seem to fit in naturally with the story. "
    }, { 
        "username": "thedocroc",
        "rating": "8/10",
        "review": "Story is pretty good, and present different perspectives (Bad/Good). Combat is fun and powers feels amazing. Game is short (if you play once), but i enjoy every second of it." 
    }, {
        "username": "randomboyj",
        "rating": "8/10",
        "review": "Here what your need to know. If you never player infamous games this is a great start. Lovely graphics very basic and 1/3 the size and verity of the others. If your a fan like myself prepare to was 8hours beating near 100% of the game feeling utterly disappointed, only one mission in the game has any impact at all...the last one. The game is good, just forgettable, repetitive and hollow, a hd tech demo." 
    }]
              
    },   {
    "title": "Killer Instinct III",
    "platform": "Xbox One",
    "release": "September 23rd 2014",    
    "condition": "Condition: Okay",
    "image":  "http://raciopporyan.github.io/Final Assignment/images/xo_killerinstinct.jpg" ,
    "comments": [
        {
        "username": "Jobadkins",
        "rating": "9/10",
        "review": "This game was awesome! The announcer Ranging from DOUBLE to ULTRAAAAAAAAAAAAA!!!! makes you feel like you accomplished something. Also the characters have great new designs, Graphics are great, a bit hard to figure out at first but then you get the hang of the combos."
    }, {
        "username": "AngolsL",
        "rating": "8/10",
        "review": "Solid fighting game. Due to the lack of fighting games during both consoles initial releases, Killer Instinct is a no-brainer for Xbox One owners who enjoy games of this genre. It's most like Street Fighter 4 if I had to make a comparison. It definitely brings it's own flair and style however. Very fun unleashing massive combos. The Ultra Edition is a good value considering you get two arcade versions of the original Killer Instinct that are standalone." 
    }, {
        "username": "figiboy",
        "rating": 6,
        "review": "Great mechanics, but it's a rip off considering the content is so shallow. $50 for a demo is not on. Let's hope that xbox decide to draw upon this blueprint and provide the people who purchased this with some nice free content." 
    }]
    },{
    "title": "The Last of Us Remastered",
    "platform": "PS4",
    "release": "September 29th 2014",    
    "condition": "Condition: Great",
    "image":  "http://raciopporyan.github.io/Final Assignment/images/ps4_lastofusremastered.jpg" ,
    "comments": [
        {
        "username": "MajorTom03",
        "rating": "10/10",
        "review": "Excellent, great story and solid gameplay. Emotionally and psychologically stirring with particular attention paid to character development. A triumph"
    }, {
        "username": "redrx8gt2005",
        "rating": "10/10",
        "review": "Great Story With Characters You Can Get Attached To , Great Remastered Graphics , A Ton Of Collectibles To Pick Up , Decent Price Tag , What More Can You Want In A Game , Naughty Dog Does It Again First Uncharted Series Now Last Of Us ..." 
    }, {
        "username": "Animator97",
        "rating": "10/10",
        "review": "BEST GAME EVER MADE, AND BEST GAME THAT WILL EVER BE MADE. Anyone who hates this game should be beaten. I know there are those who are skeptics. Yes it's linear. Yes it's about zombies. Is it cliché. Hell to the no!!!!! It has an unbeatable story that open world games, and RPG's die to have, and graphics that impress continually. The characters are real, the experience is extremely emotional and the gameplay is perfect." 
    }]
    },{
    "title": "New Super Mario Bros. U",
    "platform": "Wii U",
    "release": "November 18th 2012",    
    "condition": "Condition: Okay",
    "image":  "http://raciopporyan.github.io/Final Assignment/images/wiiu_newsupermariobrosu.jpg" ,
    "comments": [
        {
        "username": "society_max",
        "rating": "10/10",
        "review": "After New Super Mario Bros. 2, I was a bit worried that the New Mario franchise had run its course, and that there would be no more innovation in the series. Oh my goodness I was wrong. NSMBU is quite possible the best game in the franchise. Its easy to learn controls, great level design, challenging extra modes, and tons of unlockables make it perfect for anyone who has ever enjoyed any video game."
    }, {
        "username": "Mav3rek",
        "rating": "9/10",
        "review": "The game is simply fun to play. It's a classic Mario game with some new twists and turns. Having the gamepad as a 2nd screen and being able to play the game on the gamepad by itself is a thing gamers have been dreaming of for quite some time. Throw in the new challenge modes that are available and you have a game that has some nice alternatives to try out once you are done with the main story mode. Overall I really enjoyed this game and have had a blast playing it." 
    }, {
        "username": "HMK",
        "rating": "8/10",
        "review": "After 3 games that desperately tried to revitalize the core Super Mario Bros game play and style Nintendo has released New Super Mario Bros. U on the heels of New Super Mario Bros. 2, after the passing performance it" 
    }]
    },{
    "title": "Super Smash Bros.",
    "platform": "Wii U",
    "release": "November 21st 2014",    
    "condition": "Condition: Brand New!",
    "image":  "http://raciopporyan.github.io/Final Assignment/images/wiiu_supershashbrosforwiiu.jpg" ,
    "comments": [
        {
        "username": "SonOfThespis",
        "rating": "10/10",
        "review": "Super Smash Bros for Wii U happens to be the most beautiful Smash game to date, and the best casual title in the series. It fixed everything wrong with brawl, and added so much more to the game. The characters are amazing, and the music is endless. If you're into the competitive scene, then perhaps you should stick to Project M, or Melee, as this game is certainly a casual fighter. Nonetheless, I highly recommend picking this game up (with some Amiibos as well!) and having a blast with your friends!"
    }, {
        "username": "ZombieAxeHero",
        "rating": "9/10",
        "review": "I realize I'm a year and a half late with this, but I can say this game was exactly what I was hoping for. I know there's a whole bunch of crazed Melee/Project M fans lurking around saying this game is just as bad as Brawl if not more so (Brawl wasn't a bad game, by the way), and I can agree it's not the big fast competitive thing that Melee and other EVO-certified fighting games are. I can also agree that I'm disappointed there's no story mode this time, clones are still a thing (though Melee was quite frankly worse for that), and Classic Mode while given an interesting new spin isn't quite what I'd hoped for." 
    }, {
        "username": "tucotuti",
        "rating": "9//10",
        "review": "This is the most robust, fun and complete Smash Bros of all. And that is not a small feat. They've improved every part of the game, the amount of detail in each character is astonishing. The roster with almost 50 characters is the best of them and the stages are also very good. Playing for fun and at the same time with such technical precision is only possible with the Smash Bros series, and this is the best one of them." 
    }]
    },{
    "title": "The Legend of Zelda: Twilight Princess HD",
    "platform": "Wii U",
    "release": "March 4th 2016",    
    "condition": "Condition: Great",
    "image":  "http://raciopporyan.github.io/Final Assignment/images/wiiu_thelegendofzeldatwilightprincesshd_2.jpg" ,
    "comments": [
        {
        "username": "Mrtouchdown87",
        "rating": "10/10",
        "review": "An excellent experience! It's a shame the amount of care put into WindWaker HD isn't present here in the graphical presentation. That said it still looks great, if inconsistent in areas. This does nothing to bog down what stands as one of the greatest games of the past decade, however. Dark, bizarre, and utterly stunning achievment in gaming. Deserving of the highest recommendation."
    }, {
        "username": "Fijut",
        "rating": "9/10",
        "review": "After 4 days of playing, Twilight Princess HD, although still a brilliant game, may not be the perfect remake. I'm not sure where to begin, but it was a bit of a shock when i realised the original came out 10 years ago, did not think it had been that long. My experience playing it again, although enjoyable and still a brilliant game, i now come to see what some people mean when they say its one of the worst games in the series." 
    }, {
        "username": "Maxson",
        "rating": "9/10",
        "review": "When this game first came out, I was only 11 years old. It was one of my favorite gamecube games, and still one of my favorite Zelda games. Now it's been 10 years, and I finally got my hands on this awesome game again. It's still the same game from 10 years ago, but with better textures, so the game looks slightly better than before. The gameplay is still the same, which is still great. Out of all the Zelda games, I think this one has the better combat system..in my opinion. If you haven't played this game, please give it a try. It's one of the most epic Zelda games." 
    }]
    },{
    "title": "Halo: The Master Cheif Collection",
    "platform": "Xbox One",
    "release": "November 11th 2014",    
    "condition": "Condition: Okay",
    "image":  "http://raciopporyan.github.io/Final Assignment/images/xo_halothemasterchiefcollection.jpg" ,
    "comments": [
        {
        "username": "Vickes",
        "rating": "10/10",
        "review": "This collection perfect all 4 games ... well done ... even Halo 2 which was great ... the transition from classic mode pro estantaneo remake is brutal ... no lag and very rapido..parabens was perfect for MS the collection."
    }, {
        "username": "QFC",
        "rating": "7/10",
        "review": "If you like the Halo Series this is a must own. How can you argue with all the Halo games in one spot? I’m rating this at 7.5 strictly because of the multiplayer being super slow at matchmaking right now." 
    }, {
        "username": "Maximus_IL",
        "rating": "5/10",
        "review": "If you are interested in replaying campaigns on the Xbox One, this is worth the money. Most of the significant campaign bugs have been patched, and the few that remain are typical of any game. If you are interested in multiplayer (like me), watch out. While it MAY work for you, it also may not. The numerous problems, delayed patches, and lack of communication from 343i and Microsoft are quite frustrating." 
    }]
    },{
    "title": "State of Decay",
    "platform": "Xbox One",
    "release": "Apirl 28th 2015",    
    "condition": "Condition: Excellent",
    "image":  "http://raciopporyan.github.io/Final Assignment/images/xo_stateofdecay.jpg" ,
    "comments": [
        {
        "username": "GainesvilleGuy",
        "rating": "8/10",
        "review": "Somehow I missed this on the xbox360 so this was a new experience for me, and I have to say I was very impressed. I'm not a big zombie genre fan, but I am a survival fan and this game nails that pretty well. The campaign mode (base game) was too easy I think, and I thought the story missions were kind of stupid."
    }, {
        "username": "angryreviewer82",
        "rating": "8/10",
        "review": "The Walking Dead anyone? Best zombie game since a long time IMHO, even if it has some tech problems that don't compromise the experience if you like the idea of an open world game filled with undeads. RPG like stuff too!" 
    }, {
        "username": "evilxmunkee",
        "rating": "7/10",
        "review": "A great game, with only one Major drawback to it. No multiplayer? The reason I say this, they had promised multiplayer in a future patch, and then failed to deliver. Do not get me wrong, this game is amazing. I love it. But as a single player, it can only go so far" 
    }]
    }